Revit 2027 API
CurtainGridLine.AllSegmentCurves Property
Retrieve the curves of all segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray AllSegmentCurves { get; }
Public ReadOnly Property AllSegmentCurves As CurveArray
	Get
public:
property CurveArray^ AllSegmentCurves {
	CurveArray^ get ();
}
member AllSegmentCurves : CurveArray with get
Property Value
CurveArray
Remarks
User can get these curves and then call the method AddSegment() or RemoveSegment() to add/remove specified segments. If the specified segment is already added/removed, nothing will happen.
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace